# a = [['二次函数', '一次函数', 0.78], ['一次函数', '二次函数', 0.64], ['一次函数', '四边形', 0.73], ['四边形', '一次函数', 0.89], ['实数', '一次函数', 0.82], ['一次函数', '实数', 0.82], ['一次函数', '概率', 0.64], ['概率', '一次函数', 0.7], ['一次函数', '轴对称', 0.82], ['轴对称', '一次函数', 0.9], ['实数', '不等式', 0.64], ['不等式', '实数', 0.88], ['二次函数', '四边形', 0.78], ['四边形', '二次函数', 0.78], ['二次函数', '实数', 0.89], ['实数', '二次函数', 0.73], ['实数', '四边形', 0.73], ['四边形', '实数', 0.89], ['四边形', '轴对称', 0.78], ['轴对称', '四边形', 0.7], ['实数', '概率', 0.64], ['概率', '实数', 0.7], ['实数', '轴对称', 0.82], ['轴对称', '实数', 0.9], ['轴对称', '概率', 0.7], ['概率', '轴对称', 0.7], ['二次函数', '分式', 0.78], ['分式', '二次函数', 1.0], ['一次函数-实数', '四边形', 0.78], ['四边形-实数', '一次函数', 0.88], ['四边形-一次函数', '实数', 0.88], ['一次函数-实数', '四边形', 0.78], ['四边形-实数', '一次函数', 0.88], ['四边形-一次函数', '实数', 0.88], ['一次函数-实数', '轴对称', 0.89], ['轴对称-实数', '一次函数', 0.89], ['轴对称-一次函数', '实数', 0.89], ['一次函数-实数', '轴对称', 0.89], ['轴对称-实数', '一次函数', 0.89], ['轴对称-一次函数', '实数', 0.89], ['四边形-实数', '轴对称', 0.88], ['轴对称-实数', '四边形', 0.78], ['轴对称-四边形', '实数', 1.0], ['四边形-实数', '轴对称', 0.88], ['轴对称-实数', '四边形', 0.78], ['轴对称-四边形', '实数', 1.0]]
# import json
# d = json.dumps(a, ensure_ascii=False)
# print(d, type(d))
# class Hello()://
#     def show(self):
#         print(self.x)
#
#
# h = Hello()
# h.x = 1
# h.show()
d ={"大海":"蓝色", "天空":"灰色", "大地":"黑色"}
print(d.items(), type(d.items()))