""" @File   : __init__.py
    
    @Author : BabyMuu
    @Time   : 2023/2/9 13:33
"""
# from pprint import pprint
#
# a = [['三角形', '三角函数', 0.86],
#      ['有理数', '三角函数', 0.73],
#      ['实数', '三角函数', 0.73],
#      ['三角形', '三角函数', 0.9],
#      ['实数', '有理数', 0.85],
#      ['四边形', '实数', 0.88],
#      ['三角函数-实数', '四边形', 0.85],
#      ['四边形-实数', '三角函数', 0.73],
#      ['一次函数', '二次函数', 0.88],
#      ['一次函数', '反比例函数', 0.75],
#      ['二次函数', '反比例函数', 0.78],
#      ['分式-整式', '因数分解', 0.73],
#      ['圆-四边形', '几何', 0.88],
#      ['一元一次方程', '一元二次方程', 0.88],
#      ['一元一次方程', '二元二次方程', 0.89],
#      ['二元一次方程', '一元二次方程', 0.93],
#      ]
aa = ['122','2323','23123'] # 你那个字符串数组
ext = "def_func"  # 你想加的东西
res = list(map(lambda x:ext + x, aa))  # 结果
print(res)